{"soundBalance_AppFeature": {"topic": "App Use", "subtopic_id": "1", "answer_repository": "You can adjust the sound balance between bass and trebble. The higher the slider, the more “sharp/tinny” things will sound. The lower the slider, the less “tinny” things will sound. You can set the settings to whatever sounds best to you. The hearing aids are always set to their default values when they are powered on again. These settings include Universal program, middle volume (8 in the app), middle sound balance (0 in the app), and Automatic setting for directional hearing.\nIf you find yourself adjusting the settings often, especially after turning the hearing aids on for the first time at the beginning of the day, your hearing care professional can adjust the default settings of the hearing aids so they start out at the volume/balance that you like. \nAlso you can use the the Signia Assistant in the App. The Assistant will ask you a series of questions and based on your answers, it will make programming changes to the Universal program (default program the hearing aids power up into). Try using this feature to make adjustments to the general loudness of the hearing aids.", "answer_dependency": ["HA.supportsSoundBalance", "App.PairingType"], "links": ["https://features.signia-hearing.com/_features/signia-app-user-guide//en/index.html"], "pictures": ["z"], "videos": ["u"]}, "volumeControl_AppFeature": {"topic": "App Use", "subtopic_id": "2", "answer_repository": "The main menu will show the current volume control. The hearing aids are always set to their default values when they are powered on again. These settings include Universal program, middle volume (8 in the app), middle sound balance (0 in the app), and Automatic setting for directional hearing.\nIf you find yourself adjusting the settings often, especially after turning the hearing aids on for the first time at the beginning of the day, or you require a different volume permanently your hearing care professional can adjust the default settings of the hearing aids so they start out at the volume/balance that you like. \nAlso you can use the the Signia Assistant in the App. The Assistant will ask you a series of questions and based on your answers, it will make programming changes to the Universal program (default program the hearing aids power up into). Try using this feature to make adjustments to the general loudness of the hearing aids.\nAt the bottom of the Volume control, there should be a button to split the volume control into two. This option only appears with an active Bluetooth connection between the hearing aid and the phone. If your hearing aid features a rocker switch and your hearing care professional has configured the hearing aid accordingly , you can also change volume with the hearing aid directly.", "answer_dependency": ["HA.userControl", "App.PairingType"], "links": ["https://features.signia-hearing.com/_features/signia-app-user-guide//en/index.html"], "pictures": ["u"], "videos": ["u"]}, "directionalHearing_AppFeature": {"topic": "App Use", "subtopic_id": "3", "answer_repository": "The directional Hearing function offers you the possibility to adjust the directionality of your hearing aids according to your needs. This feature will allow you to steer the focus of the hearing aid microphones in the direction you want to listen from. Additionally, if you choose the frontal direction, you can control the span of that frontal focus. Drag the circles along the edge of the colored, focal area to change the span. The narrower the span, the more background sound the hearing aids will eliminate. The hearing aids are always set to their default values when they are powered on again. These settings include Universal program, middle volume (8 in the app), middle sound balance (0 in the app), and Automatic setting for directional hearing.  The Directional Hearing is only available for Performance Level 5 and Level 7 hearing aids and require an active Bluetooth connection between the hearing aid and the phone. The directional hearing section is only available when using the Universal hearing program", "answer_dependency": ["HA.supportsIntellizoom", "App.PairingType"], "links": ["https://features.signia-hearing.com/_features/signia-app-user-guide//en/index.html"], "pictures": ["u"], "videos": ["u"]}, "General_AppUse": {"topic": "App Use", "subtopic_id": "4", "answer_repository": "Using the Signia app, you can:\nChange the hearing program and microphone volume level;\nAdjust the sound balance (basses and trebles);\nAdjust the Tinnitus therapy signal (if available);\nAdjust the directionality of the hearing aid microphone individually by using the 360° Spatial Configurator;\nManage your audio streaming devices (e.g. StreamLine TV, StreamLine Mic, CROS devices, etc.) and control their volumes discreetly;\nStay in closer contact with your hearing care professional and get individual remote support via TeleCare (a prior activation by your hearing care professional is needed.\nAs a result, the Signia app offers you a wide variety of individual adjustment options enabling further personalization of your hearing experience.", "answer_dependency": ["App.PairingType"], "links": ["https://features.signia-hearing.com/_features/signia-app-user-guide//en/index.html"], "pictures": ["u"], "videos": ["u"]}, "programChange_AppFeature": {"topic": "App Use", "subtopic_id": "5", "answer_repository": "The hearing aids are able to be programmed with a multitude of different programs. Your available programs are visible with an active Bluetooth connection to your hearing aids. If you are interested in adding additional programs for noisy environments, TV, Tinnitus therapy or others we recommend informing your hearing care provider so that they can make the necessary changes. \nIf your hearing aid features a rocker switch or push button and your hearing care professional has configured the hearing aid accordingly , you can also change programs with the hearing aid directly.", "answer_dependency": ["HA.userControl", "App.PairingType"], "links": ["https://features.signia-hearing.com/_features/signia-app-user-guide//en/index.html"], "pictures": ["u"], "videos": ["u"]}, "batteryCheck_AppFeature": {"topic": "App Use", "subtopic_id": "6", "answer_repository": "The battery icons show your battery level including the percentage of charge. If Bluetooth is not connected, the battery percentages wont show, but you can tap on one of the battery icons shown in the menu. A sound played by your hearing aids will indicate the battery status. 1 beep means low, 2 beeps means medium, 3 beeps means full. While wearing the hearing aid, you will hear an alert signal to indicate the power cell  is running low. The signal will be repeated every 20 minutes.", "answer_dependency": ["App.PairingType"], "links": ["https://features.signia-hearing.com/_features/signia-app-user-guide//en/index.html"], "pictures": ["u"], "videos": ["u"]}, "myWellBeing_AppFeature": {"topic": "App Use", "subtopic_id": "7", "answer_repository": "My Wellbeing is a feature in that Signia App that is compatible with AX hearing aids. The app can pull data related to wearing time, conversation level, step counter, and activity level as tracked in the hearing aid to display. These metrics are meant to encourage the usage of hearing aids. These data points are only visible in the Signia App and are not shared with anyone else. A Bluetooth connection is required between the app and the hearing aids in order for the data to sync from the hearing aids to the app. If Bluetooth is turned off or disconnected, discrepancies in the data may occur. If you notice that the information is not updating, you can try turning Bluetooth OFF/ON to refresh the connection. For an overview of How to use My WellBeing, use this video: https://youtu.be/bqMnyQJqXHA?list=TLGGmFAu1_Du7z0xOTA3MjAyMw.", "answer_dependency": ["HA.supportsWellBeing", "App.PairingType"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "maskMode_AppFeature": {"topic": "App Use", "subtopic_id": "8", "answer_repository": "Mask Mode It is available in the Universal hearing program. Mask Mode compensates for muffled speech signals. These include gain to enhance the spectrum most relevant to speech intelligibility, effectively compensating for the adverse acoustic effects of the face mask. It also includes adjusting noise reduction as well as microphone beamforming to the ideal settings for speech signals.", "answer_dependency": ["HA.supportsMaskMode", "App.PairingType"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "digitalAssistant_AppFeature": {"topic": "App Use", "subtopic_id": "9", "answer_repository": "You can then choose from a list of options to address your need at that moment. Continue to answer the Assistant's questions until it provides a solution.\nThese steps apply both for optimizing the sound to your liking instantly as well as answering handling questions you might have to get the most out of your hearing aids with ease. Based on your replies in the dialogue, the Assistant suggests instant sound improvements for you. You can keep the new sound settings, revert back to the previous settings, or keep optimizing them further.\nYou can always start a new chat by clicking on \"Settings\" at the top right of the chat screen and selecting \"New chat with Signia Assistant\".", "answer_dependency": ["HA.supportsDigitalAssistant", "App.PairingType"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "telecare_AppFeature": {"topic": "App Use", "subtopic_id": "10", "answer_repository": "Telecare is a telehealth service that allows your hearing care provider to chat with you, better understand your needs and make remote adjustments to your hearing aids through the app. To take advantage of Telecare in your app, a separate activation is needed. Please contact your hearing care provider for further information. Do note that the app is fully functional without Telecare.  ", "answer_dependency": ["App.PairingType"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "tinnitus_volumeControl_AppFeature": {"topic": "App Use", "subtopic_id": "11", "answer_repository": "With the tinnitus volume slider, you can adjust the volume level of the therapy signal that is played in the hearing aids to mask the tinnitus. The volume level depends on your hearing and what is comfortable for you, so you may need to experiment to find the right level", "answer_dependency": ["HA.TinnitusFeatures"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "pairing_Bluetooth": {"topic": "Bluetooth", "subtopic_id": "12", "answer_repository": "In the App main menu you will find different connection options. Choose \"Bluetooth\".  Turn your hearing aids off and then back on.  Battery operated – open/close the battery doors Rechargeable - put the aids in the charger wait for the lights to turn on and wait 15 seconds, make sure the lights come on. Once you take them out of the charger the hearing aids will turn back on.\n\nIf you have an apple phone, follow this video:    https://youtu.be/1ISLz0C64lY?list=TLGGBQWxyfJuTO4xOTA3MjAyMw  Tap on \"Go to phone settings\" at the bottom. Select the option \"Hearing Aids\" under accessibility. Activate Bluetooth by swiping the menu bar next to the option \"Bluetooth\" to the right. Your apple device will detect your hearing aids automatically. you will get a pairing request in a pop-up window, where you have to tap \"Pair\". (If you have two hearing aids you will get two pairing requests). As soon as the pairing has been successful, you will see the basic settings, that you can manage via your Apple device. Return to the App and the app will automatically search, find and connect your hearing aids. Make sure the hearing aids are switched on. \n\nIf you have an android phone, follow this video: https://youtu.be/4ZXZQtj7YKA?list=TLGGvIyihIhWUoExOTA3MjAyMw Go to the settings menu. Select the option \"Connections\" und \"Settings\". Activate Bluetooth by swiping the menu bar next to the option \"Bluetooth\". Go to the App and select the option \"Bluetooth\".. The App will start searching your hearing aids. Please make sure your hearing aids are switched on. Please restart your hearing aids once and put them close to the mobile device. Once the App finds your hearing aids, they will be shown. Please tap on the row to the top to proceed. Wait a few seconds while the App completes the connection to your hearing aids.", "answer_dependency": ["Phone.OS", "App.PairingType"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "connectionIssue_Bluetooth": {"topic": "Bluetooth", "subtopic_id": "13", "answer_repository": "There may have been a Bluetooth connection issue between the phone and the aids. I would suggest the following steps to reset:\n\nIf you have an iOS phone:\n1. Power off your hearing aids. If they are battery operated open/close the battery doors. If they are rechargeable - put the aids in the charger wait for the lights to turn on and wait 15 seconds, make sure the lights come on. Once you take them out of the charger the hearing aids will turn back on.\n2. On your phone, go to Settings/Accessibility/Hearing Devices.\n3. Tap on your hearing aids listed on the screen.\n4. Scroll down and click on “Forget this device”.\n5. Once your phone has forgotten the hearing aids it should be in search mode again.\n6. Power your hearing aids back on, battery operated close the battery doors, rechargeable -- take the aids out of the charger, your phone should find them again and ask if you want to connect (pair) to the devices. Tap on “Pair” (once for each hearing aid).\nThen in the Signia App on the upper left-hand corner is where you may locate 3 white lines, tap on that. Select Settings > App settings > Set up the app > It will ask you (if you continue, the existing hearing aids pairing will be deleted, and the app will be put in a delivery state) tap on OK. It will ask you to choose a connection. Choose Bluetooth Connection. From here the app should pair with the aids\n\nIf you have an Android phone:\nPlease unpair the hearing aids from the phone’s Bluetooth menu first. You can do this by tapping on the “gear” icon to the right of the hearing aids in the Bluetooth menu and choosing to unpair or forget. Afterwards, turn Bluetooth off and on.\nGo to your phone Settings > Apps > Signia App > Storage > Clear Data.\nLaunch the Signia App and accept the terms/permissions. Choose the Bluetooth setup option and follow the on-screen instructions. To turn the hearing aids off and back on, if you have a battery operated hearing aid, either open and close the battery doors. If you have a rechargeable hearing aid place the hearing aids in the charger for 5 seconds and then take the hearing aids out again. When you see the hearing aids appear in the list, tap on the arrow to the right to continue pairing. Press Pair to any pairing requests that appear.\n\n", "answer_dependency": ["Phone.OS", "App.PairingType"], "links": ["NaN"], "pictures": ["u"], "videos": ["NaN"]}, "not_working_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "14", "answer_repository": "1. If you have rechargeable hearing aids, put the hearing aids into the charger for 15sec to reboot/recharge them, then take them back out, make sure the charger is clean and clear of any debris/build-up that could impede the hearing aid from sitting into the slot properly. If you have RIC or BTE hearing aids with charging contacts, make sure those contacts are also clean.  \nor \n2. If you have non-rechargeable hearing aids with disposable batteries, make sure to have a fresh battery, make sure the battery is orientated correctly (i.e. flat side up) and the sticker is removed, open and close the battery door, making sure the door clicks into place.\n\nSometimes we see that debris on the hearing aid itself can cause issues with the output sound from the device. \n1. If you have an ITE hearing aid: Find the openings on your hearing aid, and check for any earwax or debris buildup. ext, use the small hook or wax-pick included in your ITE hearing aid cleaning tools. Clear out the holes, and make sure to dislodge any debris so it won’t become stuck inside.\n2. If you have RIC or BTE hearing aids with earmolds try changing the wax guard.\n3. if you have RIC or BTE hearing aids with silicone domes, ensure there is no ear wax blocking the tip. A clog in the tip of the hearing aid can prevent sound from coming out. \n\nAdditionally, you can also check your own ears for any earwax build-up. \nOnce the above steps have been followed please put the hearing aid on the ear and rub the top of it to see if you hear any scratching within the ear. \nIf you hear scratching in the hearing aid while rubbing the top of it that means the hearing aid is working properly, if you do NOT hear scratching in the ear while rubbing the top of your hearing aid, please contact your hearing care provider so that they can perform hands on diagnostics to ensure the receiver on the hearing aid does not need to be replaced.\nTry listening again, they will automatically play a startup melody. If no sound is heard, please see your hearing care provider for more hands-on diagnostics", "answer_dependency": ["HA.isRechargeable", "HA.shellType_Segment", "HA.supportsDomeExchange"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "how_to_clean_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "15", "answer_repository": "\n1. If you have ITE hearing aids: Find the openings on your hearing aid, and check for any earwax or debris buildup. Facing the openings downward, gently brush at your hearing aid with a small hearing-aid brush or unused toothbrush. Holding your hearing aid face-down will prevent the loose particles from getting stuck inside the openings. Next, use the small hook or wax-pick included in your ITE hearing aid cleaning tools. Clear out the holes, and make sure to dislodge any debris so it won’t become stuck inside. Finally, wipe down your hearing aid with a clean cloth.\n\n2. If you have BTE hearing aids: Use a soft brush to remove any wax or dry skin from the outer casing of your hearing aid.  Unlike RIC hearing aids, you can never exchange the receivers in your BTE hearing aids as they are integrated in the housing. A bulb blower can be used to force air out of the tubing of your hearing aid. Water inside the tubing can cause issues, so try to get as much of it out as possible. It is recommended that you buy a dehumidifier to ensure dryness, but if you don’t have one, simply set out your hearing aids overnight.\nIf you have silicone tip, you can exchange them regularily. Here is a video how to exchange: https://youtu.be/95H3la2f4aU?list=TLGGcIwcToKVZdEyMTA3MjAyMw.\nIf you have earmolds, remove them from your hearing aid, wipe these down, and make sure to soak them in soapy water from time to time. This will prevent discoloration and deterioration. Just make sure the earmolds are completely dry before putting them back on your hearing aid. \n\n3.If you have RIC hearing aids: You have the following options use a soft brush to remove any wax or dry skin from the outer casing of your hearing aid.\nIf you have silicone tip, you can exchange them regularily. Here is a video how to exchange: https://youtu.be/95H3la2f4aU?list=TLGGcIwcToKVZdEyMTA3MjAyMw.\nIf you have earmolds, remove them from your hearing aid, wipe these down, and make sure to soak them in soapy water from time to time. This will prevent discoloration and deterioration. Just make sure the earmolds are completely dry before putting them back on your hearing aid. Occassionally, for RIC hearing aids it might be necessary to exchange your receivers, please contact your hearing care provide for this.", "answer_dependency": ["HA.isRechargeable", "HA.shellType_Segment", "HA.supportsDomeExchange"], "links": ["https://www.signia.net/en-us/blog/global/cleaning-your-hearing-aids-a-guide/"], "pictures": ["u"], "videos": ["If you have a RIC hearing aid", "here is a video how to clean it: \nhttps://sivassetsdv.blob.core.windows.net/assets/digital-assistant/CleanRIC.m4v\nif you have an ITE Instant R S hearing aid", "here is a video how to clean it:\nhttps://sivassetsdv.blob.core.windows.net/assets/digital-assistant/CleanITE.m4v"]}, "what_to_do_if_hearing_aid_got_wet": {"topic": "Hearing Aid", "subtopic_id": "16", "answer_repository": "\nDry the hearing aid off as much as possible with a microfiber cloth.  You can try to leave it out in the open to dry. You may also use a hairdryer with cold air only pointing at 10inches away and drying for about 10mins.\n1. If you have non-rechargeable hearing aid with disposable batteries, it has battery doors, leave it open with the battery door. \nHowever, if after 24 hrs it's still behaving the same way, we may need to change out the part of the hearing aid that produces the sounds (if the model of hearing aid allows it do so). I recommend contacting your hearing care provider for more options.", "answer_dependency": ["HA.isRechargeable"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "how_to_turn_on_off_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "17", "answer_repository": "1. If you have battery-powered hearing aids, turning off your hearing aids is done by opening the battery doors, turning them on close the battery doors.\nor 2. If you have rechargeable hearing aids put the hearing aids into the charger for 15sec to reboot/recharge them. Then take them back out. \n1. If your hearing aids feature rocker switch user control, press and hold the bottom or top rocker for 5 seconds to turn off.\nRelease the button and then press and hold only the bottom rocker for 5 seconds again to turn back on.\nof 2. If you have hearing aids with a push button user control, press and hold the bottom for five seconds to turn off.\nRelease the button and then press and hold only the push button for five seconds again to turn back on.\nIn general, the App cannot power the hearing aids on and off but you can mute the hearing aids with the App by sliding the volume sliders down to 0.", "answer_dependency": ["HA.isRechargeable", "HA.userControl"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "what_to_do_with_user_controls_on_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "18", "answer_repository": "If your hearing aids feature a rocker switch user control, you can use it to change the volume, change the hearing program or activate the TV stream from your Streamline TV. \nIf your hearing aids feature a push button user control, you can use it to change the volume up on one side and down on the other side and can also change hearing programs or to activate the TV stream from your Streamline TV.\nIn any case, the exact functionality depends on how your hearing care provider has programmed your hearing aids buttons.", "answer_dependency": ["HA.userControl"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "how_to_insert_and_remove_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "19", "answer_repository": "1. If you have ITE hearing aids, your hearing instruments have been fine-tuned for your right and left ear. The labeling on the hearing instruments indicates the side. \"R\" is right. \"L\" is left. Carefully push the hearing instrument into the ear canal. Twist it slightly until it sits well. Open and close your mouth to avoid accumulation of air in the ear canal. To remove, push lightly on the back of your ear to loosen the hearing instrument. Grip the hearing instrument in the ear canal with two fingers and pull it carefully out.\n2. If you have a RIC hearing aids your hearing instruments have been fine-tuned for your right and left ear. Colored markers indicate the side, red means right side, blue means left side. If you have sleeves take care that the bend of the sleeves is in line with the bend of the receiver cable. Hold the receiver cable at the bend closer to the ear piece. Carefully push the ear piece in the ear canal. Twist it slightly until it sits well. Open and close your mouth to avoid accumulation of air in the ear canal.Lift the hearing instrument and slide it over the top of your ear. The optional retention strand helps to securely retain the ear piece in your ear. To remove lift the hearing instrument and slide it over the top of your ear. If your hearing instrument is equipped with a custom shell or a mold, remove it by pulling the small removal cord toward  the back of your head. For all other ear pieces: Grip the receiver in the ear canal with two fingers and pull it carefully out.\n3. If you have BTE hearing aids your hearing instruments have been fine-tuned for your right and left ear. Colored markers indicate the side, red means right side, blue means left side. Hold the tube close to the ear piece. Carefully push the ear piece into the ear canal.Twist it slightly until it sits well. Open and close your mouth to avoid accumulation of air in the ear canal. Lift the hearing instrument and slide it over the top of your ear. The optional retention strand helps to securely retain the ear piece in your ear.  Bend the retention strand and position it carefully into the bottom of the bowl of your ear. If your hearing instrument is equipped with a custom shell or a mold, remove it by pulling the small removal cord toward  the back of your head. For all other ear pieces: Grip the receiver in the ear canal with two fingers and pull it carefully out.", "answer_dependency": ["HA.shellType_Segment", "HA.supportsDomeExchange"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "how_to_use_telecoil_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "20", "answer_repository": "If your hearing aid contains an integrated telecoil, you can utilize the telecoil to better understand in public places, which are equipped with a public loop. To do so, the hearing care provider needs setup a hearing program for telecoil usage for you. Once available all you need to do after receiving the telecoil-compatible device from your church is to change the hearing aids into that Telecoil program. You can change to the program on the hearing aid using the on-board user control on your hearing aid, which could be a push button or rocker switch depending on your hearing aid. Also, you can change into the telecoil program with the App  If you don't have a telecoil program, visit your hearing care provider and they can program it into your hearing aids. ", "answer_dependency": ["HA.userControl", "HA.supportsTelecoil"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "whisteling_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "21", "answer_repository": "\nFor any audio static or feedback issues, restart the hearing aids and ensure there is no ear wax or debris blocking the ear tip that goes into the ear. \nAdditionally, you may want try changing the wax guard (white piece) under the ear tip. If things look clear, try lowering the volume of the hearing aids to reduce the extraneous noise.\nIf you encounter further issue, the problem can be fitment. In this situation, sound leaks out of the ears and gets picked up by the microphone of the hearing aid again and re-amplified, leading to a positive feedback loop. This is best handled by your hearing care provider, as they can fine tune the audio settings such as the mic sensitivity, swap out ear tips, or send the hearing aids in for service.", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["1"]}, "lost_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "22", "answer_repository": "The app and hearing aids do not contain the software and hardware for this function. \nPlease speak with your hearing care provider to discuss the best options for finding/replacing this hearing aid. ", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "beeps_in_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "23", "answer_repository": "Generally, a descending melody or series of beeps indicates a low battery, especially if it is playing every few minutes consistently. If you are changing volumes or programs using the button on the hearing aid or the controls in a paired phone app, the beeps/clicks can be associated with those actions. Your hearing care professional can demonstrate what each of the hearing aids’ beeps/melodies sound like and what they each mean.", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "battery_runtime_hearing_aid": {"topic": "Hearing Aid", "subtopic_id": "24", "answer_repository": "Many factors attribute to battery usage. Streaming audio or phone calls can drain battery. Left and right side battery runtime can vary depending on your loss, but should not be more than 10-20%.\n1. If you have a rechargeable hearing aid with R L size rechargeable battery, your battery runtime should be up to 39h without streaming and up to 36h including 5h streaming.\n2. If you have a rechargeable hearing aid with R M size rechargeable battery, your battery runtime should be up to 28h without streaming and up to 24h including 5h streaming.\n3. If you have hearing aid with disposable 312 S size  batteries, your battery runtime should be up to 87h without streaming and up to 71h including 20h streaming.\n4. If you have hearing aid with disposable 13 M size  batteries, your battery runtime should be up to 130h without streaming and up to 120h including 20h streaming.\n5. If you have hearing aid with disposable 13 L size  batteries, your battery runtime should be up to 150h without streaming and up to 117h including 20h streaming.\n6. If you have hearing aid with disposable 675 X L size  batteries, your battery runtime should be up to 277h without streaming and up to 217h including 60h streaming.\n\nThe connection of the app to the hearing aids in itself does not have significant impact on the battery life of the phone. If you have rechargeable hearing aids, please check and ensure there is no dirt, debris, ear wax, etc. in the charger slots. Also, check the hearing aid to make sure is it free of any wax or dirt that could impede the hearing aids from sitting fully in the charger.\nIf the hearing aids are not lasting throughout the whole day please contact your hearing care provider so that they can perform hands on diagnostics.", "answer_dependency": ["HA.isRechargeable", "HA.batterySize"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "led_Charger": {"topic": "Charger", "subtopic_id": "25", "answer_repository": "If you have an ITE charger, there are three hearing aid charging status LEDs on each side of the charger. No LED on means Charger is not connected to the power supply. Single LED successively turns on and off means charger is connected to the power supply and is ready to charge. Single LED pulsing means charging status is 0-33%. Turn on single LED and pulsing single green LED means charging status is 34%-66%. Turn on two green LEDs and pulsing single green LED means charging status is 67%-99%. Three LEDs green means hearing instrument is fully charged.  Single amber LED flashes successively means cooling phase, charging is resumed after 5minutes. If LEDs flash red, an error has occured. Take the hearing instruments out of the charger\nand disconnect the charger from the power supply.  Reconnect the charger to the power supply and re-insert the hearing instruments in the charging  cups.If the LEDs are still blinking red:\nTake the hearing instruments out of the chargerand disconnect the charger from the power supply. Contact your Hearing Care Professional for support\n\nIf you have a standard charger, there is one hearing aid charging status LED on each side of the charger. No LED on means charger is not connected to the power supply.  Green LED light blinks 3 times means charger is connected to the power supply and is ready to charge. Flashing LED green light means charging is in progress. Solid green LED light means hearing aid is fully charged. If a red LED blinks 3 times in 2 seconds, an error has occured. Take the hearing instruments out of the charger and disconnect the charger from the power supply. Reconnect the charger to the power supply and\nre‑insert the hearing instruments in the charging slots. Charger has reached the temperature limit and needs to cool down. Charging is resumed when the temperature decreases below 45 °C. If the LEDs are still blinking red, take the hearing instruments out of the charger and disconnect the charger from the power supply. Contact your Hearing Care Professional forsupport. \n\nIf you have a portable charger of the Styletto charger, there is a charger LED indicating the status of the charger and its internal battery and one hearing aid charging status LED on each side of the charger. The charger internal battery LED flashes green if the internal battery is charged. It is solid green if the charger is fully charged.  If is is blinking red, an error has occured. To check whether the charger's internal battery has enough capacity to fully charge your hearing instruments when you are mobile. Disconnect the charger from the electrical outlet. Briefly press the push button.\nThe charger LED indicates the status of the charger's internal battery for 7 seconds. Solid green means the internal battery has enough capacity to fully charge a pair of hearing instruments. Solid orange means the internal battery does not have enough capacity to fully charge a pair of hearing instruments. Blinking orange means the internal charger battery is empty. Charging of hearing instruments is not possible.\nFor the charging status LEDs,  pulsing green means hearing instrument is being charged. Solid green means the hearing instrument is fully charged. LED is off means no hearing instrument is in the charger, a hearing instrument is not placed correctly, or the charger is discharged. Blinking red means an error has ocurred. Take the hearing instruments out of the charger and disconnect the charger from the power supply. Reconnect the charger to the power supply and re‑insert the hearing instruments in the charging slots.  Charger has reached the temperature limit and needs to cool down. Charging is resumed when the temperature decreases below 45°C (113°F). If the LEDs are still blinking red  Take the hearing instruments out of the charger and disconnect the charger from the power supply  Contact your Hearing Care Professional for support.\n\nIf you have a Dry & Clean Charger, there is a status LED for UV cleaning and three hearing aid charging status LED on each side of the charger. The cleaning status LED is slowly blinking white for 15 minutes when UVC cleaning. No LED light means no hearing ad is inserted in the charger. LEDs rapidly blinking in sequence means the charger is ready to charge. Of the three LEDs blinking green three times means that charging is initiated. One LED slowly blinking green means charging is in progress with state of charge <33%. 1 solid green LED and 2nd LED slowly blinking means charging is in progress with state of charge 34%-66%. 2 solid green LEDs and 3rd LED slowly blinking means charging is in progress and state of charge is 67%-99%. 3 solid green LEDs mean that hearing instrument is fully charged. LEDs blinking rapidly orange in sequence means the charger is cooling down. All LEDs blinking red means an error has occured. Take the hearing instruments out\nof the charger and disconnect the charger from the power supply. Reconnect the charger to the power supply and re-insert the hearing instruments in the charging slots. Charger has reached the temperature limit and needs to cool down. Charging is resumed when the temperature decreases below 45 °C. If the LEDs are still blinking red Take the hearing instruments out of the charger and disconnect the charger from the power supply and contact your Hearing Care Professional for support.\n", "answer_dependency": ["HA.isRechargeable"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "powerPlug_Charger": {"topic": "Charger", "subtopic_id": "26", "answer_repository": "The charger uses a  standard USB-A to USB-C cord together with a power adaptor. Connect the USB-C side of the USB power cable to the USB port of the charger\nConnect the other side of the USB-A power cable to a suitable electrical plug", "answer_dependency": ["HA.isRechargeable"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "powerBank_Charger": {"topic": "Charger", "subtopic_id": "27", "answer_repository": "If you have a portable charger, or the Styletto charger or the Active Charger when you are mobile with no electrical outlet available, you can still charge your hearing instruments. Energy is fed from the chargers's integrated battery into your hearing instruments. The charger must be turned on to do so. The charging status of charger and hearing instruments is shown by pushing the button or opening the lid. The portable charger can be turned off when not connected to the electrical outlet. This might be useful when you want to store your hearing aids in the charger for a longer time. Press and hold the button or 5 seconds to turn the charger on and off", "answer_dependency": ["HA.isRechargeable", "HA.supportsChargerITE", "HA.supportsChargerStyletto", "HA.supportsChargerStandard", "HA.supportsChargerPortable", "HA.supportsChargerDryAndClean"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "qi_Charger": {"topic": "Charger", "subtopic_id": "28", "answer_repository": "If you have the Styletto charger or the Active Charger you can charge your charger wirelessly. Place the charger on a wireless Qi certified transmitter pad. After a few seconds the internal battery will start charging indicated by the pulsing green LED of the charger. When hearing aids are inserted, they start charging as well indicated by the pulsing green LED of the hearing aids LED. If the LED is off, please re-align the charger to the center of the Qi transmitter pad. The charging status of the charger is shown until it is fully charged. After that the LEDs are turned off for power saving reasons.", "answer_dependency": ["HA.isRechargeable", "HA.supportsChargerITE", "HA.supportsChargerStyletto", "HA.supportsChargerStandard", "HA.supportsChargerPortable", "HA.supportsChargerDryAndClean"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "dry_and_clean_Charger": {"topic": "Charger", "subtopic_id": "29", "answer_repository": "Dry&Clean chargers not only charge the hearing aids but also offer UVC cleaning and drying technology to keep the hearing aids in peak condition. The UVC cleaning starts automatically when the hearing aids are placed inside and is completed in just 15 minutes.", "answer_dependency": ["HA.isRechargeable", "HA.supportsChargerITE", "HA.supportsChargerStyletto", "HA.supportsChargerStandard", "HA.supportsChargerPortable", "HA.supportsChargerDryAndClean"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "does_not_charge_Charger": {"topic": "Charger", "subtopic_id": "30", "answer_repository": "Please ensure the charger is plugged into the wall outlet, not in any power strip, computer, or anything other than directly into the wall. Please check the charger and ensure there is no dirt, debris, ear wax, etc. in the charger slots. Also, check the hearing aid to make sure it is free of any wax or dirt that could impede the hearing aids from sitting fully in the charger. If you have RIC or BTE hearing aids, please also clean the charging contacts. You can swap the hearing aids from side-to-side in the charger to see if the charging issue follows the hearing aid or remains on the same charging slot. Ensure you are using the supplied charging cable and USB block. If possible, try a different outlet. Wiggle the hearing aids when placing into the charger to make sure they seat properly.\nIf the charging problems persist, please contact your hearing care provider and let them know the results of these tests so they can guide you on the next steps.\n\nIf you have an ITE charger, ensure the hearing aids are resting flat in the charger. The faceplate (flat part with the push button on it) needs to be parallel to the charger's base/table surface.", "answer_dependency": ["HA.isRechargeable", "HA.supportsChargerITE", "HA.supportsChargerStyletto", "HA.supportsChargerStandard", "HA.supportsChargerPortable", "HA.supportsChargerDryAndClean"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "broken_or_misplaced_Charger": {"topic": "Charger", "subtopic_id": "31", "answer_repository": "Our customary referral would be to request the extra charger through your Hearing Care Professional, as they are always best to assist you with your hearing care needs.  Hearing instruments and accessories are sold and replaced by independent retailers who set their own prices, policies, and services.   If your hearing care provider does not regularly stock the item, they can contact us and order it on your behalf", "answer_dependency": ["HA.isRechargeable", "HA.supportsChargerITE", "HA.supportsChargerStyletto", "HA.supportsChargerStandard", "HA.supportsChargerPortable", "HA.supportsChargerDryAndClean"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "charge_does_not_last_Charger": {"topic": "Charger", "subtopic_id": "32", "answer_repository": "The runtime of all lithium-ion rechargeable batteries reduces over time. The original estimates are based on fresh lithium-ion rechargeable battery capacity. Under normal operating conditions, the battery will retain up to 80% of its initial capacity after 2 years of use. Please note that battery performance will vary depending on individual usage patterns and environmental conditions.\nIf you find that the battery for the left hearing aid is discharging abnormally fast, consult with your hearing care provider for further service inquiries. They will be able to let you know your options for repair or exchange.", "answer_dependency": ["HA.isRechargeable", "HA.batterySize"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "miniPocket_Accessory": {"topic": "Accessories", "subtopic_id": "33", "answer_repository": "Here are the steps for repairing your miniPocket remote to your hearing aids: \nLock the remote control. The key lock switch is located on the right-hand side of the remote. You should see a red color on that switch when the remote is in the locked position.   \nTurn the hearing aids Off.** \nTurn the hearing aids On.** \nInsert the hearing instruments into your ears. \nHold down the “P” button on the remote control while switching the key lock to the unlock position (green color visible). \nRelease the “P” button. The remote control is now in setup mode (the LED will be on). While the remote control is in setup mode, do not press + or - buttons. This will change other settings. \nHold down the P button until the pairing confirmation sound is played in the hearing aids. It takes approximately 2 seconds for the sound to start playing. \nEnsure that the confirmation sound is heard in both hearing aids. When heard, the pairing will be complete. The remote control will remain in setup mode for an additional 30 seconds. The confirmation sound can be played again by pressing P during these 30 seconds. \nTo exit the setup mode of the remote control, wait 30 seconds or move the key lock switch to the lock position (red color visible). \nYou can unlock the remote control and begin using it. \n**= If your hearing aids have batteries, you can power the hearing aids off and on by opening and closing the battery doors. \nIf your hearing aids are rechargeable, you can power the hearing aids off and on by placing them in the charger and then taking them out. ", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "Support": {"topic": "HCP", "subtopic_id": "34", "answer_repository": " Please use the website below to locate a hearing care provider in your area. \nhttps://www.signia.net/en-us/store-locator/ ", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "Background noise": {"topic": "Sound", "subtopic_id": "35", "answer_repository": "If you want to get rid of background noise, first check to see if you have another program to change to. Your provider may have provided you with a hearing program specific for noise (e.g. Noisy Environment). Tap on Universal at the top of the app to see if you can access a program list and see if there are other programs to switch to. \nIf you only have the one, Universal program, and your hearing aid supports Directional Focus you can go to the Directional Hearing feature in the app. Tap on the tab with the icon that looks like the target near the bottom right of the app. You will see a compass like display. You can choose from the 4 directions depending on where you would like the hearing aid to focus. If you choose the frontal direction, you can also choose the span of that focus. The narrower the span is, the more background sound will be cut out and the more the hearing aids will focus on sounds coming from directly in front of you. You can change the span by dragging on the circles along the edge of the colored circle portion of the focus area.  \n\nLastly, if you don't find any of the above helpful or you want the changes you're making to be the default, visit your hearing care provider and they can make permanent changes to your hearing aids. ", "answer_dependency": ["HA.supportsIntellizoom"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "Handsfree Streaming": {"topic": "Bluetooth", "subtopic_id": "36", "answer_repository": "if your hearing aid supports Handsfree phone and your phone is iPhone 11 or newer with iOS 15.2 or newer the Handsfree feature allows the hearing aid to pick up your voice for phone conversations after initiating or answering the call on the iPhone. Once HandsFree is activated in the hearing aids, you can triple click the iPhone’s Home/Side button to access the MFi Hearing Devices shortcut menu to see the Mic Input options for turning HandsFree On or Off.", "answer_dependency": ["HA.supportsHandsfreeCallsiOS", "Phone.OS"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "androidStreaming_Bluetooth": {"topic": "Bluetooth", "subtopic_id": "37", "answer_repository": "If you have an ASHA compatible android phone and an ASHA compatible hearing aid https://www.signia.net/support/compatibility and are using Android 11 or higher you can stream phone and audio from your smartphone.\n For our hearing aids with older chips that are still Bluetooth compatible, an accessory called the StreamLine Microphone can be used to facilitate streaming from Android phones. ASHA protocol Android phone program to connect to hearing and Bluetooth connection is created by Google. Google created the program to allow hearing aids to connect directly to hearing aids. Google is aware this ASHA program has a Bluetooth Bug that causes the hearing aids to now have an unstable connection and is working on fixing the issue. Here are few workarounds you can try: \nTurn the phone’s Bluetooth off and then back on and then try streaming again \nor \nTurn off Bluetooth on the phone, Turn on airplane mode on the phone, Turn off airplane mode on the phone, Turn on Bluetooth on the phone, Try streaming again \nor \nReboot the phone and turn off hearing aids, When phone is back on, turn just one hearing aid on,Wait 15 seconds before turning the second hearing aid on \n You can also try a combination of the steps above.  ", "answer_dependency": ["HA.supportsASHA", "Phone.supportsASHA"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "streamingConfiguration_Bluetooth": {"topic": "Bluetooth", "subtopic_id": "38", "answer_repository": "if you have an apple phone, here are some features and configuration to help enhance your streaming experience: \nIf you don't want phone calls to stream: \niPhone Settings > Accessibility > Hearing Devices > Audio Routing > Call Audio > Never hearing devices. \nThis will default calls to your iPhone but still allow you to choose your hearing aids manually.  \nYou can do the same for Media Audio in the same menu. \nIf you want to silence the phone's ringtone, you can go to the same Hearing Devices menu and turn off Play Ringtones. Do note that this will also silence the Alarms in the hearing aids.  \nIf you want to silence system sounds in the hearing aids like notification sounds or keyboard clicks, turn off Play System Sounds. \nIf you want to turn off all audio streaming with no option to manually switch to the hearing aids, tap on the hearing aids listed in blue in the Hearing Devices menu and then turn off the Stream to R and L options.\nif you want to stream audio from two devices disable Bluetooth on the device you are not streaming from. For example, if a phone call streams to the hearing aids from the iPhone and then you want to listen to something from the iPad, disable Bluetooth on the iPhone first and then enable Bluetooth on the iPad.  The hearing aids will disconnect from the iPhone and connect to the iPad. \n Live Listen is an Apple iOS feature that turns the Apple device (e.g. iPhone, iPad, etc.) into a remote microphone. In other words, you can turn Live Listen ON and place the Apple device up to 30ft away to detect sounds and stream those sounds directly to the hearing aid. To learn more, visit the following webpage: https://support.apple.com/en-us/HT203990", "answer_dependency": ["Phone.OS"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "apple_watch_AppFeature": {"topic": "App Use", "subtopic_id": "39", "answer_repository": "The hearing aids can only pair with Apple’s iOS and the Android* operating systems (* depending on hearing aid model) for direct streaming. \nSince the Apple Watch runs Apple’s watchOS operating system, pairing and streaming directly from the Apple Watch to the hearing aids is not possible. But if your Apple Watch is running WatchOS 8.7 or newer and your iPhone’s iOS is 16 or newer, you can control the hearing aids using the Watch’s Control Center.  See this article about accessing the Watch's Control Center. Once in there, look for an \"ear\" icon you can tap on to reveal more options for controlling the hearing aids. This has nothing to do with our app and more so to do with the native iOS pairing between your iPhone and the hearing aids.  \nhttps://support.apple.com/guide/watch/control-center-apd06bc15da1/watchos ", "answer_dependency": ["Phone.OS"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "StreamlineTV": {"topic": "Accessories", "subtopic_id": "40", "answer_repository": "Thanks for contacting us with your inquiry. Streaming television audio can be accomplished with the StreamLine TV (SLTV) accessory. This device will pair wirelessly to your hearing aids. \nThe SLTV is a device that is connected to an audio output on the television using either an analog, RCA or digital, optical (toslink) connection. This device can be ordered through your hearing care provider", "answer_dependency": ["NaN"], "links": ["https://www.signia.net/en/chargers-and-accessories/streamline-tv/"], "pictures": ["u"], "videos": ["u"]}, "pair_StreamlineTV_Accessory": {"topic": "Accessories", "subtopic_id": "41", "answer_repository": "Turn your hearing aids off and back on. You can do so by placing the hearing aids in the charger for 5 seconds and then taking them out. If the hearing aids have battery doors, open and close the battery doors. After the hearing aids turn back on, place them on top of the of the SLTV. You will see double blue lights show up. \nAfter you see the double blue lights appear, you can put the hearing aids back in your ears. \nNow try to connect to the SLTV to listen to TV audio ", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "use_StreamlineTV_Accessory": {"topic": "Accessories", "subtopic_id": "42", "answer_repository": "The hearing aids can connect to the SLTV in 3 possible ways depending on how your hearing care provider programmed the hearing aids. Please consult with them for details: \nChanging to the TV program using the app, a remote control, or a button on your hearing aid \nActivating the connection by a short press or medium press on the button on the hearing aid \nUse the Streaming tab in the Signia App when the app is connected to your hearing aids through Bluetooth ", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["u"], "videos": ["u"]}, "use_StreaminlineMic_Accessory": {"topic": "Accessories", "subtopic_id": "43", "answer_repository": "The StreamLine Mic transforms your Signia devices into more than state-of-the-art hearing aids. They also become a hands-free mobile headset and wireless headphones that stream premium stereo quality from any Bluetooth device – mobile phones, PCs, laptops, and smart assistants like Alexa, Siri and Google Assistant.", "answer_dependency": ["NaN"], "links": ["https://www.signia.net/en/chargers-and-accessories/streamline-mic/"], "pictures": ["u"], "videos": ["u"]}, "pair_StreamlineMic_Accessory": {"topic": "Accessories", "subtopic_id": "44", "answer_repository": "To pair your hearing aid to the Streamline mic, StreamLine Mic off and on. Switch the hearing aids off and on. Place both hearing aids next to StreamLine Mic (maximum distance: 20cm). The pairing process starts automatically where the status display flashes yellow. As soon as pairing is complete, the status display turns yellow.\nTo Pair StreamLine Mic with your Bluetooth device (e.g. smartphone) in three easy steps:\nMake sure that your device’s Bluetooth is on (via “settings” menu)\nPress StreamLine Mic’s multi-function button and “+” button simultaneously for about 6 seconds. The status display starts flashing blue. (You now have 3 minutes to finish pairing.)\nClick on “StreamLine Mic” in your device’s Bluetooth menu (if a PIN is requested, enter “0000”). As soon as pairing is complete, the status display turns blue.\nPairing only needs to be performed once. Subsequently, the pairing activates as soon as the hearing aids, StreamLine Mic and Bluetooth device are switched on.", "answer_dependency": ["NaN"], "links": ["NaN"], "pictures": ["NaN"], "videos": ["NaN"]}}