{"HA.supportsIntellizoom": {"True": "Your hearing aids support the feature Directional Focus in the App", "False": "Your hearing aids do not support the feature Directional Focus in the App"}, "HA.supportsDigitalAssistant": {"True": "Your hearing aids support the feature Digital Assistant in the App", "False": "Your hearing aids do not support the feature Digital Assistant in the App"}, "HA.supportsSoundBalance": {"True": "Your hearing aids supports the feature Sound Balance in the App", "False": "Your hearing aids do not support the feature Sound Balance in the App"}, "HA.supportsWellBeing": {"True": "Your hearing aids support the feature My Wellbeing in the App", "False": "Your hearing aids do not support the feature My Wellbeing in the App"}, "HA.supportsMaskMode": {"True": "Your hearing aids support the feature Mask Mode in the App", "False": "Your hearing aids do not support the feature Mask Mode in the App"}, "HA.supportsChargerStyletto": {"True": "Your hearing aids are compatible with the Styletto Charger", "False": "Your hearing aids are not compatible with the Styletto Charger"}, "HA.isRechargeable": {"True": "You have rechargeable hearing aids.", "False": "You have non-rechargeable hearing aids using disposable batteries"}, "HA.supportsChargerITE": {"True": "Your hearing aids are compatible with the ITE charger", "False": "Your hearing aids are not compatible with the ITE charger"}, "HA.supportsChargerDryAndClean": {"True": "Your hearing aids are compatible to the Dry & Clean Charger", "False": "Your hearing aids are not compatible to the Dry & Clean Charger"}, "HA.supportsChargerStandard": {"True": "Your hearing aids are compatible with the Standard charger", "False": "Your hearing aids are not compatible with the Standard charger"}, "HA.supportsChargerPortable": {"True": "Your hearing aids are compatible to the Portable Charger", "False": "Your hearing aids are not compatible to the Portable Charger"}, "HA.shellType_Segment": {"BTE": "You have BTE hearing aids", "ITE": "You have ITE hearing aids", "RIC": "You have RIC hearing aids"}, "HA.userControl": {"RockerSwitch": "Your hearing aids feature a rocker switch user control", "PushButton": "Your hearing aids feature a push button user control", "None": "Your hearing aids do not feature on-board user controls"}, "HA.supportsDomeExchange": {"True": "Your hearing aids support silicone domes, but you may also be equipped with earmolds", "False": "Your hearing aids do not support silicone domes"}, "HA.supportsHandsfreeCallsiOS": {"True": "Your hearing aids support Handsfree Calls for iOS", "False": "Your hearing aids do not support Handsfree Calls for iOS"}, "HA.supportsASHA": {"True": "Your hearing aids support the ASHA standard for streaming with Android", "False": "Your hearing aids do not support ASHA streaming for Android"}, "HA.supportsTelecoil": {"True": "Your hearing aids contain an integrated telecoil", "False": "Your hearing aids do not contain a telecoil"}, "HA.supportsMFI": {"True": "Your hearing aid supports MFI Streaming for Apple phones", "False": "Your hearing aids do not support MFI Streaming for Apple phones"}, "HA.batterySize": {"13 L": "Your hearing aids work with 13 size non-rechargeable batteries", "R L": "Your hearing aids have large size rechargeble batteries", "13 M": "Your hearing aids work with 13 size non-rechargeable batteries", "R M": "Your hearing aids have medium size rechargeable batteries", "10 XS": "Your hearing aids work with 10 size non-rechargeable batteries", "R S": "Your hearing aids have small size rechargeable batteries", "312 S": "Your hearing aids work with 312 size non-rechargeable batteries", "675 XL": "Your hearing aids work with 675 size non-rechargeable batteries"}, "HA.TinnitusFeatures": {"NotAvailable": "Your hearing aids do not support Tinnitus therapy sounds", "NATTinnitusandNoiser": "Your hearing aids support Tinnitus therapy sounds and Notched Amplification Therapy", "NoiserOnly": "Your hearing aid support Tinnitus relief sounds"}, "HA.supportsStreamlineAccessories": {"True": "Your hearing aids support streaming with Streamline TV and Streamline Mic accessories", "False": "Your hearing aids do not support streaming with Streamline TV and Streamline Mic accessories"}, "App.PairingType": {"QR": "You have not paired your hearing aids with the App using Blueooth. \nAs a result your Signia app is missing some features like Directional Hearing, Split Volume Control, Digital Assistant, Mask Mode or WellBeing or is not showing the hearing program fitted by your hearing care professional. Also battery status is not availble as precise as when connecting with Bluetooth.\nPlease consider pairing again with Bluetooth. ", "Manual": "You have not paired your hearing aids with the App using Blueooth. \nAs a result your Signia app is missing some features like Directional Hearing, Split Volume Control, Digital Assistant, Mask Mode or WellBeing or is not showing the hearing program fitted by your hearing care professional. Also battery status is not availble as precise as when connecting with Bluetooth.\nPlease consider pairing again with Bluetooth. ", "Bluetooth-Telecare": "You have paired your hearing aids with the App using Bluetooth and have installed Telecare. In some cases it might be necessary to repair", "Bluetooth ": "You have paired your hearing aids with the App using Bluetooth. In some cases it might be necessary to repair"}, "Phone.supportsASHA": {"asha grey list": "Your phone supports ASHA streaming, but performance may vary", "asha white list": "Your phone supports ASHA streaming", "asha unknown": "Your phone might support ASHA streaming"}, "Phone.OS": {"iOS": "You have an iOS phone which supports MFI streaming", "Android": "You have an android phone"}}