{"HA.supportsIntellizoom": {"True": "Your hearing system supports Directional Focus", "False": "Your hearing system does not support Directional Focus"}, "HA.supportsDigitalAssistant": {"True": "Your hearing system support the feature Digital Assistant", "False": "Your hearing system does not support the feature Digital Assistant"}, "HA.supportsSoundBalance": {"True": "Your hearing system supports the feature Sound Balance", "False": "Your hearing system does not support the feature Sound Balance"}, "HA.supportsWellBeing": {"True": "Your hearing system supports the feature Wellbeing", "False": "Your hearing system does not support the feature Wellbeing"}, "HA.supportsMaskMode": {"True": "Your hearing system support the feature Mask Mode", "False": "Your hearing system does not support the feature Mask Mode"}, "HA.supportsChargerStyletto": {"True": "Your hearing aid is compatible with the Styletto Charger", "False": "Your hearing aid is not compatible with the Styletto Charger"}, "HA.isRechargeable": {"True": "You have rechargeable hearing aids", "False": "You have non-rechargeable hearing aids using disposable batteries"}, "HA.supportsChargerITE": {"True": "Your hearing aid is compatible with the ITE charger", "False": "Your hearing aid is not compatible with the ITE charger"}, "HA.supportsChargerDryAndClean": {"True": "Your hearing aid is compatible to the Dry & Clean Charger", "False": "Your hearing aid is not compatible to the Dry & Clean Charger"}, "HA.supportsChargerStandard": {"True": "Your hearing aid is compatible with the Standard charger", "False": "Your hearing aid is not compatible with the Standard charger"}, "HA.supportsChargerPortable": {"True": "Your hearing aid is compatible to the Portable Charger", "False": "Your hearing aid is not compatible to the Portable Charger"}, "HA.shellType_Segment": {"BTE": "You have BTE hearing aids", "ITE": "You have ITE hearing aids", "RIC": "You have RIC hearing aids"}, "HA.userControl": {"RockerSwitch": "Your hearing aids feature a rocker switch user control", "PushButton": "Your hearing aids feature a push button user control", "None": "Your hearing aids do not feature on-board user controls"}, "HA.supportsDomeExchange": {"True": "Your hearing system supports silicone domes, but you may also be equipped with earmolds", "False": "Your hearing system does not support silicone domes"}, "HA.supportsHandsfreeCallsiOS": {"True": "Your hearing aid supports Handsfree Calls for iOS", "False": "Your hearing aid does not support Handsfree Calls for iOS"}, "HA.supportsASHA": {"True": "Your hearing aid supports the ASHA standard for streaming with Android", "False": "Your hearing aid does not support ASHA streaming for Android"}, "HA.supportsTelecoil": {"True": "Your hearing aid contains an integrated telecoil", "False": "Your hearing aid does not contain a telecoil"}, "HA.supportsMFI": {"True": "Your hearing aid supports MFI Streaming for Apple phones", "False": "Your hearing aid does not support MFI Streaming for Apple phones"}, "HA.batterySize": {"13 L": "Your hearing aid works with 13 size non-rechargeable batteries", "R L": "Your hearing aid has a large size rechargeble battery", "13 M": "Your hearing aid works with 13 size non-rechargeable batteries", "R M": "Your hearing aid has a medium size rechargeable battery", "10 XS": "Your hearing aid works with 10 size non-rechargeable batteries", "R S": "Your hearing aids has a small size rechargeable battery", "312 S": "Your hearing aid works with 312 size non-rechargeable batteries", "675 XL": "Your hearing aid works with 675 size non-rechargeable batteries"}, "HA.TinnitusFeatures": {"NotAvailable": "Your hearing aid does not support Tinnitus relief sounds", "NATTinnitusandNoiser": "Your hearing aid supports Tinnitus relief sounds and Notched Amplification Therapy", "NoiserOnly": "Your hearing aid supports Tinnitus relief sounds"}, "HA.supportsStreamlineAccessories": {"True": "Your hearing aid supports streaming with Streamline TV and Streamline Mic accessories", "False": "Your hearing aid does not support streaming with Streamline TV and Streamline Mic accessories"}, "App.PairingType": {"QR Code Pairing": "You have not paired your hearing aids with the App using Blueooth. \nAs a result your Signia app is missing some features like Directional Hearing, Split Volume Control, Digital Assistant, Mask Mode or WellBeing or is not showing the hearing program fitted by your hearing care professional. Also battery status is not availble as precise as when connecting with Bluetooth.\nPlease consider pairing again with Bluetooth. ", "Manual Pairing": "You have not paired your hearing aids with the App using Blueooth. \nAs a result your Signia app is missing some features like Directional Hearing, Split Volume Control, Digital Assistant, Mask Mode or WellBeing or is not showing the hearing program fitted by your hearing care professional. Also battery status is not availble as precise as when connecting with Bluetooth.\nPlease consider pairing again with Bluetooth. ", "Bluetooth-Telecare": "You have paired your hearing aids with the App using Bluetooth and have installed Telecare. In some cases it might be necessary to repair", "Bluetooth Pairing": "You have paired your hearing aids with the App using Bluetooth. In some cases it might be necessary to repair"}, "Phone.supportsASHA": {"asha grey list": "Your phone supports ASHA streaming, but performance may vary", "asha white list": "Your phone supports ASHA streaming", "asha unknown": "Your phone might support ASHA streaming"}, "Phone.OS": {"iOS": "You have an iOS phone which supports MFI streaming", "Android": "You have an android phone"}}